from json.decoder import NaN

import pytest

import pandas as pd


@pytest.fixture
def sample_data():
    data = {"Дата операции": ["01.01.2021 10:00:00", "02.01.2021 12:00:00"], "Сумма": [100, 200]}
    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], dayfirst=True)
    return df


@pytest.fixture
def transactions_fixture():
    return [
        {"Номер карты": "1234567812345814", "Сумма операции": 1000, "Статус": "OK"},
        {"Номер карты": "1234567812344321", "Сумма операции": 2000, "Статус": "OK"},
        {"Номер карты": "1234567812345814", "Сумма операции": -500, "Статус": "OK"},
        {"Номер карты": None, "Сумма операции": 1000, "Статус": "OK"},
        {"Номер карты": "1234567812344321", "Сумма операции": "invalid", "Статус": "OK"},
    ]


@pytest.fixture
def transactions():
    return [
        {
            "Дата платежа": "2021-12-21",
            "Сумма платежа": 1000,
            "Сумма операции с округлением": 1000.00,
            "Номер карты": "1234",
            "Категория": "Переводы",
            "Описание": "Описание 1",
        },
        {
            "Дата платежа": "2021-12-22",
            "Сумма платежа": 2000,
            "Сумма операции с округлением": 2000.00,
            "Номер карты": None,
            "Категория": "Переводы",
            "Описание": "Описание 2",
        },
        {
            "Дата платежа": "2021-12-23",
            "Сумма платежа": 3000,
            "Сумма операции с округлением": 3000.00,
            "Номер карты": "5678",
            "Категория": "Переводы",
            "Описание": "Описание 3",
        },
    ]


@pytest.fixture()
def transactions_lst():
    return [
        {
            "Дата операции": "04.01.2018 14:05:08",
            "Дата платежа": "06.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1065.9,
            "Валюта операции": "RUB",
            "Сумма платежа": -1065.9,
            "Валюта платежа": "RUB",
            "Кэшбэк": 10.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Пятёрочка",
            "Бонусы (включая кэшбэк)": 21,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1065.9,
        },
        {
            "Дата операции": "03.01.2018 15:03:35",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -73.06,
            "Валюта операции": "RUB",
            "Сумма платежа": -73.06,
            "Валюта платежа": "RUB",
            "Кэшбэк": NaN,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Magazin 25",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 73.06,
        },
        {
            "Дата операции": "21.01.2018 15:17:26",
            "Дата платежа": "23.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -46.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -46.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": NaN,
            "Категория": "Различные товары",
            "MCC": 5331.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 46.0,
        },
    ]
