import pytest

import pandas as pd


@pytest.fixture
def sample_data():
    data = {"Дата операции": ["01.01.2021 10:00:00", "02.01.2021 12:00:00"], "Сумма": [100, 200]}
    df = pd.DataFrame(data)
    df["Дата операции"] = pd.to_datetime(df["Дата операции"], dayfirst=True)
    return df


@pytest.fixture
def transactions_fixture():
    return [
        {"Номер карты": "1234567812345814", "Сумма операции": 1000, "Статус": "OK"},
        {"Номер карты": "1234567812344321", "Сумма операции": 2000, "Статус": "OK"},
        {"Номер карты": "1234567812345814", "Сумма операции": -500, "Статус": "OK"},
        {"Номер карты": None, "Сумма операции": 1000, "Статус": "OK"},
        {"Номер карты": "1234567812344321", "Сумма операции": "invalid", "Статус": "OK"},
    ]


@pytest.fixture
def transactions():
    return [
        {
            "Дата платежа": "2021-12-21",
            "Сумма платежа": 1000,
            "Сумма операции с округлением": 1000.00,
            "Номер карты": "1234",
            "Категория": "Переводы",
            "Описание": "Описание 1",
        },
        {
            "Дата платежа": "2021-12-22",
            "Сумма платежа": 2000,
            "Сумма операции с округлением": 2000.00,
            "Номер карты": None,
            "Категория": "Переводы",
            "Описание": "Описание 2",
        },
        {
            "Дата платежа": "2021-12-23",
            "Сумма платежа": 3000,
            "Сумма операции с округлением": 3000.00,
            "Номер карты": "5678",
            "Категория": "Переводы",
            "Описание": "Описание 3",
        },
    ]
