import json

from json.decoder import NaN

from unittest.mock import patch

import pytest

from src.services import search_by_numbers


@patch("src.services.services_logger.info")
@pytest.mark.parametrize(
    "search_bar, expected_calls",
    [
        ("Супермаркеты", ["Начало обработки списка словарей", "Новый список по запросу: 'Супермаркеты' создан"]),
        ("Колхоз", ["Начало обработки списка словарей", "Новый список по запросу: 'Колхоз' создан"]),
    ],
)
def test_logging_search(mock_logger, transactions_lst, search_bar, expected_calls):
    search_by_numbers(search_bar, transactions_lst)
    for call in expected_calls:
        mock_logger.assert_any_call(call)


@pytest.mark.parametrize(
    "search_input, expected_output",
    [
        (
            "супермаркеты",
            [
                {
                    "Дата операции": "04.01.2018 14:05:08",
                    "Дата платежа": "06.01.2018",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -1065.9,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -1065.9,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": 10.0,
                    "Категория": "Супермаркеты",
                    "MCC": 5411.0,
                    "Описание": "Пятёрочка",
                    "Бонусы (включая кэшбэк)": 21,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 1065.9,
                },
                {
                    "Дата операции": "03.01.2018 15:03:35",
                    "Дата платежа": "04.01.2018",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -73.06,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -73.06,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": NaN,
                    "Категория": "Супермаркеты",
                    "MCC": 5499.0,
                    "Описание": "Magazin 25",
                    "Бонусы (включая кэшбэк)": 1,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 73.06,
                },
            ],
        ),
        (
            "колхоз",
            [
                {
                    "Дата операции": "21.01.2018 15:17:26",
                    "Дата платежа": "23.01.2018",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -46.0,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -46.0,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": NaN,
                    "Категория": "Различные товары",
                    "MCC": 5331.0,
                    "Описание": "Колхоз",
                    "Бонусы (включая кэшбэк)": 0,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 46.0,
                }
            ],
        ),
        ("ничего", []),
    ],
)
def test_search_by_numbers(transactions_lst, search_input, expected_output):
    result = search_by_numbers(search_input, transactions_lst)
    assert json.loads(result) == expected_output
